html/optimizing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-25 Wed 02:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>optimizing</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="preload" href="syntax.css" as="style" onload="this.onload=null;this.rel='stylesheet'">
<noscript><link rel="stylesheet" href="syntax.css"></noscript>
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<a style="color: inherit; text-decoration: none" href="/">
<h2>Ketan's Digital Laboratory &#129514;</h2>
</a>
</div>
<div id="content" class="content">
<h1 class="title">optimizing</h1>


<div id="outline-container-ID-f368ca02-b398-4af9-9f31-cfc0205c271f" class="outline-2">
<h2 id="ID-f368ca02-b398-4af9-9f31-cfc0205c271f">Optimize for clear, improvable goals</h2>
<div class="outline-text-2" id="text-org3148df4">
<p>
I think that optimizing for clear, measurable metrics is a powerful <a href="frames.html#ID-00c8e647-350b-473d-bd27-8ac4836820b8">frame</a>. Dan Luu talks about how one can get better at their craft in <a href="https://danluu.com/p95-skill/">https://danluu.com/p95-skill/</a> &#x2013; <a href="practice.html#ID-7fd55afc-19d5-4f5c-918b-b90a2073b0f0">practice</a> in an intentional way. Get feedback from others, and even from your past self by recording yourself and analyzing it.<br />
</p>
</div>
</div>
<div id="outline-container-org54f0647" class="outline-2">
<h2 id="org54f0647">Optimizing for good goals</h2>
<div class="outline-text-2" id="text-org54f0647">
<p>
On the flip side, it's crucial to deeply consider what you're optimizing for, and why. There's been some (rightful) pushback against "optimization mindset" in Silicon Valley. I think it's kind of throwing out the baby with the bathwater to say that "optimization = bad"&#x2026; that said, their core point holds water, in that lots of tech involves optimizing for objectives without any forethought about <i>why</i> a particular objective was chosen.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Made with <span class="heart">♥</span> using
<a href="https://orgmode.org/">org-mode</a>.
Source code is available
<a href="https://github.com/ketan0/digital-laboratory">here</a>.</p>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js" async></script>
</div>
</body>
</html>
